sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Source/BSW/Wdg/Wdg_TMS570LS3x.c
/* Copyright (C) 2011-2012 TTTech Automotive GmbH. All rights reserved
** Schoenbrunnerstrasse 7, A-1040 Wien, Austria. office(at)tttech-automotive.com
**
** Name:
**   Wdg_TMS570LS3x.c
**
** Purpose: Platform specific implementation (TMS570LS3x) of the Safe Watchdog
**          Driver part of the Modular Safety Platform.
**
*/

/* ***************************************************************************
** Includes
******************************************************************************/
#include "Wdg_TMS570LS3x.h"
#include "Wdg_TMS570LS3x_reg_defs.h"
#if (WDG_DEM_REPORT == STD_ON)
    #include "Appl_Dem.h"
#endif
#if (WDG_DEV_ERROR_DETECT == STD_ON)
  #include "Appl_Det.h"
#endif

#if ((defined(__CANTATA__)) || (defined(PC_TEST)))
  #if ((__CANTATA__ == 1) || (defined(PC_TEST)))
    #include "tms570ls3x_wdg_emulation.h"
  #endif
#endif

/* ***************************************************************************
** Source version
******************************************************************************/
#define WDG_TMS570LS3x_SW_MAJOR_VERSION_SOURCE 2
#define WDG_TMS570LS3x_SW_MINOR_VERSION_SOURCE 0
#define WDG_TMS570LS3x_SW_PATCH_VERSION_SOURCE 3

/* defines for expected Wdg.h Version */
#define EXPECTED_WDG_SW_MAJOR_VERSION       2
#define EXPECTED_WDG_SW_MINOR_VERSION       0
/* defines for expected Wdg_Cfg.h Version */
#define EXPECTED_WDG_CFG_SW_MAJOR_VERSION   2
#define EXPECTED_WDG_CFG_SW_MINOR_VERSION   0

/* Protection against incorrect include file version */
#if !(  (WDG_TMS570LS3x_SW_MAJOR_VERSION ==     \
         WDG_TMS570LS3x_SW_MAJOR_VERSION_SOURCE \
        )                                       \
     && (WDG_TMS570LS3x_SW_MINOR_VERSION ==     \
         WDG_TMS570LS3x_SW_MINOR_VERSION_SOURCE \
        )                                       \
     && (WDG_TMS570LS3x_SW_PATCH_VERSION ==     \
         WDG_TMS570LS3x_SW_PATCH_VERSION_SOURCE \
        )                                       \
     )
  #error "Version mismatch! Incorrect version of Wdg_TMS570LS3x.h"
#endif

/* Protection against incorrect Wdg_TMS570LS3x_Cfg.h include file version */
#if !(  (WDG_TMS570LS3x_CFG_SW_MAJOR_VERSION == \
         WDG_TMS570LS3x_SW_MAJOR_VERSION_SOURCE \
        )                                       \
     && (WDG_TMS570LS3x_CFG_SW_MINOR_VERSION == \
         WDG_TMS570LS3x_SW_MINOR_VERSION_SOURCE \
        )                                       \
     && (WDG_TMS570LS3x_CFG_SW_PATCH_VERSION == \
         WDG_TMS570LS3x_SW_PATCH_VERSION_SOURCE \
        )                                       \
     )
  #error "Version mismatch! Incorrect version of Wdg_TMS570LS3x_Cfg.h"
#endif

/* Protection against incorrect Wdg_TMS570LS3x_reg_defs.h include file version */
#if !(  (WDG_TMS570LS3x_REG_DEFS_SW_MAJOR_VERSION == \
         WDG_TMS570LS3x_SW_MAJOR_VERSION_SOURCE      \
        )                                            \
     && (WDG_TMS570LS3x_REG_DEFS_SW_MINOR_VERSION == \
         WDG_TMS570LS3x_SW_MINOR_VERSION_SOURCE      \
        )                                            \
     && (WDG_TMS570LS3x_REG_DEFS_SW_PATCH_VERSION == \
         WDG_TMS570LS3x_SW_PATCH_VERSION_SOURCE      \
        )                                            \
     )
  #error "Version mismatch! Incorrect version of Wdg_TMS570LS3x_reg_defs.h"
#endif

/* Protection against incorrect Wdg.h include file version */
#if !(  (WDG_SW_MAJOR_VERSION ==                 \
         EXPECTED_WDG_SW_MAJOR_VERSION           \
        )                                        \
     && (WDG_SW_MINOR_VERSION ==                 \
         EXPECTED_WDG_SW_MINOR_VERSION           \
        )                                        \
     )
  #error "Version mismatch! Incorrect version of Wdg.h"
#endif

/* Protection against incorrect Wdg_Cfg.h include file version */
#if !(  (WDG_CFG_SW_MAJOR_VERSION ==             \
         EXPECTED_WDG_CFG_SW_MAJOR_VERSION       \
        )                                        \
     && (WDG_CFG_SW_MINOR_VERSION ==             \
         EXPECTED_WDG_CFG_SW_MINOR_VERSION       \
        )                                        \
     )
  #error "Version mismatch! Incorrect version of Wdg_Cfg.h"
#endif

/* ------------------------------------------------------------------------- */
/*                        SUPRESSED MISRA VIOLATONS                          */
/* ------------------------------------------------------------------------- */
/* Error Message : Msg(4:1503) The function 'Wdg_TMS570LS3x_Init' /
                   'Wdg_TMS570LS3x_SetMode' /
                   'Wdg_TMS570LS3x_SetTriggerWindow' /
                   'Wdg_TMS570LS3x_GetVersionInfo'
                   is defined but is not used within this project.
 * Justification : The function is an interface of this SW module to the upper
                   SW layers, such as WdgIf.                                 */

/* Error Message : Msg(4:5087) #include statements in a file should only be
                   preceded by other preprocessor directives or comments.
 * Justification : MemMap-pragmas must be included here. See AUTOSAR
 *                 requirement MEMMAP003.                                    */

/* Error Message : Msg(4:0303) [I] Cast between a pointer to object and an
                   integral type.
 * Justification : RTIDWDCTRL, RTIDWDPRLD, RTIWDKEY and RTIDWDCNTR are
                   TMS570LS3x specific registers, which are situated at fixed
                   addresses in the memory.                                  */

/* Error Message : Msg(4:3335) No function declaration. Implicit declaration
                   inserted: 'extern int GlobalSuspendInterrupts();' /
                   'extern int GlobalRestoreInterrupts();'.
 * Justification : These are compiler intrinsic function.                    */

/* Error Message : Msg(4:3356) The result of this logical operation is always
                   'false'.
                   Msg(4:3359) The value of this control expression is always
                   'false'.
 * Justification : According to AUTOSAR a DET check for this parameter is
                   necessary. Furthermore, it is possible that the caller
                   function passes a wrong value for the parameter of the enum
                   type WdgIf_ModeType, e.g. via a unit8 variable.           */

/* Error Message : Msg(4:1317) Value not in the enumeration type.
 * Justification : Inverted value of the variabled is stored here for memory
                   check, it is intended that the value is out of bounds.     */

/* Error Message : Msg(6:0306) [I] Cast between a pointer to object and an
                   integral type.
 * Justification : Inverted value of the pointer is stored in the variable on
                   purpose in order to check for memory corruption.           */

