sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Source/BSW/Wdg/Wdg_TMS570LS3x.c
/* Error Message : Msg(6:0277) [I] An integer constant expression with negative
                   value is being converted to an unsigned type.
 * Justification : Inverted value of the integer constant is stored in the
                   variable on purpose in order to check for memory
                   corruption.                                                */

/* Error Message : Msg(4:3355) The result of this logical operation is always
                   'true'.
 * Justification : The inverted value of a variable and the variable itself
                   differ if some other software module overwrites the memory.
                   That this logical operation may become false is proven within
                   the unit tests.                                            */

/* Error Message : Msg(4:3358) The value of this 'if' control expression is
                   always 'true'.
 * Justification : The inverted value of a variable and the variable itself
                   differ if some other software module overwrites the memory.
                   that this logical operation may become false is proven within
                   the unit tests.                                            */

/* Error Message : Msg(4:3201) This statement is unreachable.
 * Justification : The statement is indeed reachable: it is possible that the
                   caller function passes a wrong value for the parameter of
                   the enum type WdgIf_ModeType, e.g. via a unit8 variable.  */

/* Error Message : Msg(4:3453) A function could probably be used instead of this
                   function-like macro.
 * Justification : This simple computation is used only once in the code and is
                   realized as a macro in the beginnig of the file together with
                   other computations for a better code readybility. A function
                   would be very inefficient. */

/* ***************************************************************************
** Globals
******************************************************************************/
#define WDG_START_SEC_VAR_8BIT
#include "MemMap.h"
STATIC VAR(WdgIf_ModeType, WDG_VAR) g_wdg_tms570ls3x_current_mode = WDGIF_OFF_MODE;
/* PRQA S 1317 2 */
STATIC VAR(WdgIf_ModeType, WDG_VAR) g_wdg_tms570ls3x_current_mode_INV =
    (WdgIf_ModeType)~WDGIF_OFF_MODE;
#define WDG_STOP_SEC_VAR_8BIT
#include "MemMap.h" /* PRQA S 5087 */

#define WDG_START_SEC_VAR_32BIT
#include "MemMap.h" /* PRQA S 5087 */
/* global variable to save the current Configuration Pointer of the Watchdog */
STATIC P2CONST(Wdg_TMS570LS3x_ConfigType, WDG_VAR, WDG_CONST) g_wdg_tms570ls3x_cfg_ptr = NULL_PTR;
/* global variable to save the inverted value of the current Configuration Pointer */
/* PRQA S 0306 2 */
STATIC P2CONST(Wdg_TMS570LS3x_ConfigType, WDG_VAR, WDG_CONST) g_wdg_tms570ls3x_cfg_ptr_INV =
    (const Wdg_TMS570LS3x_ConfigType *)(~(uint32)NULL_PTR);
#define WDG_STOP_SEC_VAR_32BIT
#include "MemMap.h" /* PRQA S 5087 */

#define WDG_START_SEC_VAR_16BIT
#include "MemMap.h" /* PRQA S 5087 */
/* global variable to save the current Window of the Watchdog */
STATIC VAR(uint16, WDG_VAR) g_wdg_tms570ls3x_window_start = 0u; /* in ms */
/* global variable to save the inverted value of the current Window of the Watchdog */
/* PRQA S 0277 1 */
STATIC VAR(uint16, WDG_VAR) g_wdg_tms570ls3x_window_start_INV = (uint16)~0u;
/* global variable to save the current Timeout of the Watchdog */
STATIC VAR(uint16, WDG_VAR) g_wdg_tms570ls3x_last_timeout = 0u; /* in ms */
/* global variable to save the inverted value of the current Timeout of the Watchdog */
/* PRQA S 0277 1 */
STATIC VAR(uint16, WDG_VAR) g_wdg_tms570ls3x_last_timeout_INV = (uint16)~0u;
#define WDG_STOP_SEC_VAR_16BIT
#include "MemMap.h" /* PRQA S 5087 */


/* ***************************************************************************
** Macros
******************************************************************************/

#define READ_RTIDWDPRLD (*RTIDWDPRLD)
#define READ_RTIDWDCNTR (*RTIDWDCNTR)
#define READ_RTIWDKEY   (*RTIWDKEY)
#define READ_RTIDWDCTRL (*RTIDWDCTRL)
#define READ_RTIFRC1    (*RTIFRC1)
#define READ_RTICPUC1   (*RTICPUC1)
#define READ_RTIGCTRL   (*RTIGCTRL)

#if ((!defined(__CANTATA__)) && (!defined(PC_TEST)))
    #define WRITE_RTIDWDPRLD (*RTIDWDPRLD) =
    #define WRITE_RTIDWDCNTR (*RTIDWDCNTR) =
    #define WRITE_RTIWDKEY   (*RTIWDKEY)   =
    #define WRITE_RTIDWDCTRL (*RTIDWDCTRL) =
  #if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
    #define WRITE_RTICPUC1   (*RTICPUC1) =
    #define WRITE_RTIGCTRL   (*RTIGCTRL) =
  #endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */
#else
    #define WRITE_RTIDWDPRLD pc_write_RTIDWDPRLD
    #define WRITE_RTIDWDCNTR pc_write_RTIDWDCNTR
    #define WRITE_RTIWDKEY   pc_write_RTIWDKEY
    #define WRITE_RTIDWDCTRL pc_write_RTIDWDCTRL
  #if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
    #define WRITE_RTICPUC1   pc_write_RTICPUC1
    #define WRITE_RTIGCTRL   pc_write_RTIGTRL
  #endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */
#endif

/* PRQA S 3453 2 */
#define WDG_TMS570LS3x_MS_TO_PRLD(_ms,_RTICLK_khz) \
    ((((uint32)(_ms) * (_RTICLK_khz)) / (1u << 13u)) - 1u)

/* PRQA S 3453 2 */
#define WDG_TMS570LS3x_WDTICKS_TO_MS(_wdticks,_RTICLK_khz) \
    ((_wdticks) / (_RTICLK_khz))

/* PRQA S 3453 2 */
#define WDG_TMS570LS3x_MS_TO_WDTICKS(_ms,_RTICLK_khz) \
    ((uint32)(_ms) * (_RTICLK_khz))

#if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
/* PRQA S 3453 2 */
#define WDG_TMS570LS3x_TICKS_TO_CPUC(_ticks,_RTICLK_khz) \
    ((((_RTICLK_khz) * 1000u) / (_ticks)) - 1u)
#endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */


/* ***************************************************************************
** Module internal functions
******************************************************************************/

/* Internal functions' prototypes */
STATIC FUNC (void, WDG_CODE) wdg_tms570ls3x_reset (void);
STATIC FUNC (Std_ReturnType, WDG_CODE) wdg_tms570ls3x_check_window_start
    ( VAR (uint16, AUTOMATIC) window_start
    , VAR (uint16, AUTOMATIC) last_timeout
    , VAR (uint32, AUTOMATIC) rtickl_khz
    );
STATIC FUNC (Wdg_TMS570LS3x_ConfigChecksumType, WDG_CODE) wdg_tms570ls3x_checksum
    (P2CONST (Wdg_TMS570LS3x_ConfigType, AUTOMATIC, WDG_APPL_CONST) ConfigPtr);

#define WDG_START_SEC_CODE
#include "MemMap.h" /* PRQA S 5087 */

STATIC FUNC (void, WDG_CODE) wdg_tms570ls3x_reset (void)
{
    (void) Wdg_GlobalSuspendInterrupts(); /* PRQA S 3335 */
    /* Prepare the KEY register and then write a wrong value */
    WRITE_RTIWDKEY (RTIWDKEY_PREPARE); /* PRQA S 0303 */
    /* Now write a wrong value, RTIWDKEY_TRIGGER expected */
    WRITE_RTIWDKEY (RTIWDKEY_WRONG_VAL); /* PRQA S 0303 */
    /* Not reached, if HW is working correctly */
    (void) Wdg_GlobalRestoreInterrupts(); /* PRQA S 3335 */
}

