sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Source/BSW/Wdg/Wdg_TMS570LS3x.c
STATIC FUNC (Std_ReturnType, WDG_CODE) wdg_tms570ls3x_check_window_start
    ( VAR (uint16, AUTOMATIC) window_start
    , VAR (uint16, AUTOMATIC) last_timeout
    , VAR (uint32, AUTOMATIC) rtickl_khz
    )
{
    VAR (uint32, AUTOMATIC) elapsed_time_wdticks;   /* since last watchdog service in wdticks */
    VAR (uint32, AUTOMATIC) remaining_time_wdticks; /* until watchdog overflow in wdticks */
    VAR (uint32, AUTOMATIC) last_timeout_wdticks;   /* last set timeout in wdticks */
    VAR (uint32, AUTOMATIC) last_window_wdticks;    /* last set window in wdticks */
    VAR (Std_ReturnType, AUTOMATIC) ret = E_OK;

    /* Perform check only if a window is set */
    if (window_start > 0u)
    {
        remaining_time_wdticks = READ_RTIDWDCNTR; /* PRQA S 0303 */
        last_timeout_wdticks = WDG_TMS570LS3x_MS_TO_WDTICKS
                                (last_timeout, rtickl_khz);
        last_window_wdticks  = WDG_TMS570LS3x_MS_TO_WDTICKS
                                (window_start, rtickl_khz);

        /* Remaining time cannot be greater than last set timeout - otherwise a watchdog */
        /* timeout would already have occurred.                                          */
        elapsed_time_wdticks = last_timeout_wdticks - remaining_time_wdticks;

        /* Is this an attempt to trigger the watchdog earlier than the set window? */
        if (elapsed_time_wdticks < last_window_wdticks)
        {
            /* Start Window violation! Perform Watchdog reset! */
            ret = E_NOT_OK;
            wdg_tms570ls3x_reset ();
        }
    }

    return ret;
}

STATIC FUNC (Wdg_TMS570LS3x_ConfigChecksumType, WDG_CODE) wdg_tms570ls3x_checksum
    (P2CONST (Wdg_TMS570LS3x_ConfigType, AUTOMATIC, WDG_APPL_CONST) ConfigPtr)
{
    VAR (Wdg_TMS570LS3x_ConfigChecksumType, AUTOMATIC) cs = 0u;

    /* Basic configuration */
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->BasicCfgPtr->InitialMode)           << 0u;
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->BasicCfgPtr->InitialTimeout_ms)     << 1u;
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->BasicCfgPtr->InitialWindowStart_ms) << 0u;
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->BasicCfgPtr->SlowModeMax_ms)        << 1u;
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->BasicCfgPtr->FastModeMax_ms)        << 0u;

    /* Module version */
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->BasicCfgPtr->WdgConfigMajorVersion) << 1u;
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->BasicCfgPtr->WdgConfigMinorVersion) << 0u;

    /* TMS570LS3x specific configuration parameters */
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->RTICLK_khz)  << 0u;
    #if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
    cs += ((Wdg_TMS570LS3x_ConfigChecksumType) ConfigPtr->TickFreq_hz) << 1u;
    #endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */

    return cs;
}

#define WDG_STOP_SEC_CODE
#include "MemMap.h" /* PRQA S 5087 */

/* ***************************************************************************
** Module functions
******************************************************************************/
#define WDG_START_SEC_CODE
#include "MemMap.h" /* PRQA S 5087 */

/* PRQA S 1503 1 */
FUNC(Std_ReturnType, WDG_CODE) Wdg_TMS570LS3x_Init
    (P2CONST(Wdg_TMS570LS3x_ConfigType, AUTOMATIC, WDG_APPL_CONST) ConfigPtr)
{
    VAR (Std_ReturnType, AUTOMATIC) ret = E_NOT_OK;
    VAR(uint16, AUTOMATIC) window_start;
    VAR(uint16, AUTOMATIC) last_timeout;
    VAR(WdgIf_ModeType, AUTOMATIC) current_mode;
    P2CONST (Wdg_BasicConfigurationType, AUTOMATIC, WDG_APPL_CONST) basic_cfg_ptr;
    P2CONST (Wdg_TMS570LS3x_ConfigType, AUTOMATIC, WDG_APPL_CONST) config_ptr;
    VAR (uint32, AUTOMATIC) reg_prld;
    VAR (uint32, AUTOMATIC) reg_ctrl;
    VAR (uint32, AUTOMATIC) rtidwdprld_value;
  #if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
    VAR (uint32, AUTOMATIC) reg_gctrl;
    VAR (uint32, AUTOMATIC) reg_cpuc1;
    VAR (uint32, AUTOMATIC) rtigctrl_value;
    VAR (uint32, AUTOMATIC) rticpuc1_value;
  #endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */

    /* check global variables for consistency */
    window_start = g_wdg_tms570ls3x_window_start;
    last_timeout = g_wdg_tms570ls3x_last_timeout;
    current_mode = g_wdg_tms570ls3x_current_mode;
    config_ptr   = g_wdg_tms570ls3x_cfg_ptr;
    /* PRQA S 3355 5 */ /* PRQA S 3358 5 */
    if ( ((uint16)~window_start != g_wdg_tms570ls3x_window_start_INV)
      || ((uint16)~last_timeout != g_wdg_tms570ls3x_last_timeout_INV)
      || ((WdgIf_ModeType)~current_mode != g_wdg_tms570ls3x_current_mode_INV)
      || ((uint32)~(uint32)config_ptr != (uint32)g_wdg_tms570ls3x_cfg_ptr_INV) /* PRQA S 0306 */
       )
    {
        /* Memory courruption detected! Perform a RESET */
        ret = E_NOT_OK;
        wdg_tms570ls3x_reset ();
    }

    /* Development error detect */
    /* PRQA S 3201 1 */
    else if (ConfigPtr == NULL_PTR)
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_Init
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
    }
    else if (ConfigPtr->BasicCfgPtr == NULL_PTR)
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_Init
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
    }
    /* PRQA S 3359 1 */ /* PRQA S 3356 1 */
    else if (ConfigPtr->BasicCfgPtr->InitialMode > WDGIF_FAST_MODE)
    /* PRQA S 3201 1 */
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_Init
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
    }
    else if ( (ConfigPtr->BasicCfgPtr->WdgConfigMajorVersion != WDG_TMS570LS3x_SW_MAJOR_VERSION_SOURCE)
           || (ConfigPtr->BasicCfgPtr->WdgConfigMinorVersion != WDG_TMS570LS3x_SW_MINOR_VERSION_SOURCE)
            )
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_Init
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
    }
    else if (wdg_tms570ls3x_checksum (ConfigPtr) != ConfigPtr->ConfigChecksum)
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_Init
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
    }
    else
    /* If DET checks were successful */
    {
        #if (WDG_DISABLE_ALLOWED == STD_OFF)
        if (ConfigPtr->BasicCfgPtr->InitialMode == WDGIF_OFF_MODE)
        {
            #if (WDG_DEM_REPORT == STD_ON)
            /* If not allowed report failure */
            Appl_Dem_ReportErrorStatus ( WDG_E_DISABLE_REJECTED
                                       , DEM_EVENT_STATUS_FAILED
                                       );
            #endif
        }
        else
        {
        #endif /* WDG_DISABLE_ALLOWED == STD_OFF */

            /* Perform init */
            basic_cfg_ptr = ConfigPtr->BasicCfgPtr;

            /* Check if already initialized and if so - check timeout value */
            if (config_ptr != NULL_PTR)
            {
                /* Check window start, if already initialized
                   (and therefore running) */
                /* If first call of Init then window start is 0 and the check
                   cannot lead to reset. */
                ret = wdg_tms570ls3x_check_window_start
                    (window_start, last_timeout, config_ptr->RTICLK_khz);

                /* ret is here E_NOT_OK only if the window was violated but no
                   reset occurred. This could happen if the HW is not working
                   properly. */
                if (ret == E_OK)
                {
                    if (basic_cfg_ptr->InitialTimeout_ms == last_timeout)
                    {
                        /* Copy configuration pointer */
                        g_wdg_tms570ls3x_cfg_ptr     = ConfigPtr;
                        g_wdg_tms570ls3x_cfg_ptr_INV =
                            (const Wdg_TMS570LS3x_ConfigType *)(~(uint32)ConfigPtr); /* PRQA S 0306 */

