sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Source/BSW/Wdg/Wdg_TMS570LS3x.c
                        /* Update g_wdg_tms570ls3x_current_mode */
                        g_wdg_tms570ls3x_current_mode     = basic_cfg_ptr->InitialMode;
                        g_wdg_tms570ls3x_current_mode_INV =
                            (WdgIf_ModeType)~(basic_cfg_ptr->InitialMode);

                        /* Update g_wdg_tms570ls3x_window_start */
                        g_wdg_tms570ls3x_window_start     = basic_cfg_ptr->InitialWindowStart_ms;
                        g_wdg_tms570ls3x_window_start_INV =
                            (uint16)~(basic_cfg_ptr->InitialWindowStart_ms);

                        /* g_wdg_tms570ls3x_last_timeout already set */
                    }
                    else
                    {
                        /* TMS570LS3x's watchdog can be set only once! */
                        #if (WDG_DEV_ERROR_DETECT == STD_ON)
                        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                                             , WDG_TMS570LS3x_VENDOR_ID
                                             , API_ID_Wdg_Init
                                             , WDG_E_PARAM_TIMEOUT
                                             );
                        #endif /* (WDG_DEV_ERROR_DETECT == STD_ON) */

                        ret = E_NOT_OK;
                    }
                }
            }
            else
            {
                /* ---------------------- */
                /* Init RTIDWDPRLD and activate watchdog only once */
                rtidwdprld_value = WDG_TMS570LS3x_MS_TO_PRLD
                    (basic_cfg_ptr->InitialTimeout_ms, ConfigPtr->RTICLK_khz);
              #if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
                rticpuc1_value = WDG_TMS570LS3x_TICKS_TO_CPUC
                    (ConfigPtr->TickFreq_hz, ConfigPtr->RTICLK_khz);
              #endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */
                /* Disable interrupts */
                (void) Wdg_GlobalSuspendInterrupts(); /* PRQA S 3335 */
                /* Compute and set reload value */
                WRITE_RTIDWDPRLD (rtidwdprld_value); /* PRQA S 0303 */
                reg_prld = READ_RTIDWDPRLD; /* PRQA S 0303 */
                /* Enable Watchdog */
                WRITE_RTIDWDCTRL (RTIDWDCTRL_ENABLED); /* PRQA S 0303 */
                reg_ctrl = READ_RTIDWDCTRL; /* PRQA S 0303 */
              #if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
                /* Write to Compare Up Counter register the value calculated
                   according to definition:
                   fRTIFRCx = fRTICLK / (RTICPUC+1) */
                WRITE_RTICPUC1 (rticpuc1_value); /* PRQA S 0303 */
                /* Read back the RTICPUC1 register */
                reg_cpuc1 = READ_RTICPUC1; /* PRQA S 0303 */
                /* Read global control register value */
                reg_gctrl = READ_RTIGCTRL; /* PRQA S 0303 */
                /* Enable counter block 1 - set bit1 to 1, other bits remain unchanged
                   RTIGCTRL_ENABLED = 00....010*/
                rtigctrl_value = reg_gctrl | RTIGCTRL_ENABLED; /* PRQA S 0303 */
                /* Write new value to global control register*/
                WRITE_RTIGCTRL (rtigctrl_value); /* PRQA S 0303 */
                /* Read back the global control register value */
                reg_gctrl = READ_RTIGCTRL; /* PRQA S 0303 */
              #endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */
                /* Restore interrupts */
                (void) Wdg_GlobalRestoreInterrupts(); /* PRQA S 3335 */
                /* ---------------------- */

                /* Read back and check register contents */
                if ( (reg_prld  != rtidwdprld_value)
                  || (reg_ctrl  != RTIDWDCTRL_ENABLED)
                #if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
                  || (reg_cpuc1 != rticpuc1_value)
                  || (reg_gctrl != rtigctrl_value)
                #endif /* (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON) */
                   )
                {
                    ret = E_NOT_OK;
                }
                else
                {
                    /* Copy configuration pointer */
                    g_wdg_tms570ls3x_cfg_ptr     = ConfigPtr;
                    g_wdg_tms570ls3x_cfg_ptr_INV =
                        (const Wdg_TMS570LS3x_ConfigType *)(~(uint32)ConfigPtr); /* PRQA S 0306 */

                    /* Update g_wdg_tms570ls3x_current_mode */
                    g_wdg_tms570ls3x_current_mode     = basic_cfg_ptr->InitialMode;
                    g_wdg_tms570ls3x_current_mode_INV =
                        (WdgIf_ModeType)~(basic_cfg_ptr->InitialMode);

                    /* Update g_wdg_tms570ls3x_window_start */
                    g_wdg_tms570ls3x_window_start     = basic_cfg_ptr->InitialWindowStart_ms;
                    g_wdg_tms570ls3x_window_start_INV =
                        (uint16)~(basic_cfg_ptr->InitialWindowStart_ms);

                    /* Update g_wdg_tms570ls3x_last_timeout */
                    g_wdg_tms570ls3x_last_timeout     = basic_cfg_ptr->InitialTimeout_ms;
                    g_wdg_tms570ls3x_last_timeout_INV =
                        (uint16)~(basic_cfg_ptr->InitialTimeout_ms);

                    ret = E_OK;
                }
            }
        #if (WDG_DISABLE_ALLOWED == STD_OFF)
        }
        #endif /* WDG_DISABLE_ALLOWED == STD_OFF */
    }

    return ret;
}

/* PRQA S 1503 1 */
FUNC(Std_ReturnType, WDG_CODE) Wdg_TMS570LS3x_SetMode
    (VAR (uint8, AUTOMATIC) WdgInstance, VAR (WdgIf_ModeType, AUTOMATIC) WdgMode)
{
    VAR (Std_ReturnType, AUTOMATIC) ret;
    VAR (WdgIf_ModeType, AUTOMATIC) current_mode;
    VAR(uint16, AUTOMATIC) window_start;
    VAR(uint16, AUTOMATIC) last_timeout;
    P2CONST (Wdg_TMS570LS3x_ConfigType, AUTOMATIC, WDG_APPL_CONST) config_ptr;

    /* Check global variables for consistency */
    window_start = g_wdg_tms570ls3x_window_start;
    last_timeout = g_wdg_tms570ls3x_last_timeout;
    current_mode = g_wdg_tms570ls3x_current_mode;
    config_ptr   = g_wdg_tms570ls3x_cfg_ptr;
    /* PRQA S 3355 5 */ /* PRQA S 3358 5 */
    if ( ((uint16)~window_start != g_wdg_tms570ls3x_window_start_INV)
      || ((uint16)~last_timeout != g_wdg_tms570ls3x_last_timeout_INV)
      || ((WdgIf_ModeType)~current_mode != g_wdg_tms570ls3x_current_mode_INV)
      || ((uint32)~(uint32)config_ptr != (uint32)g_wdg_tms570ls3x_cfg_ptr_INV) /* PRQA S 0306 */
       )
    {
        /* Memory courruption detected! Perform a RESET */
        ret = E_NOT_OK;
        wdg_tms570ls3x_reset ();
    }

    /* Development error detect */
    /* PRQA S 3201 1 */
    else if (g_wdg_tms570ls3x_cfg_ptr == NULL_PTR)
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_SetMode
                             , WDG_E_DRIVER_STATE
                             );
        #endif
        ret = E_NOT_OK;
    }
    else if (WdgInstance > 0u)
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_SetMode
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
        ret = E_NOT_OK;
    }
    /* PRQA S 3356 1 */ /* PRQA S 3359 1 */
    else if (WdgMode > WDGIF_FAST_MODE)
    /* PRQA S 3201 1 */
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_SetMode
                             , WDG_E_PARAM_MODE
                             );
        #endif
        ret = E_NOT_OK;
    }
    else
    /* If DET checks were successful */
    {
    #if (WDG_DISABLE_ALLOWED == STD_OFF)
        if (WdgMode == WDGIF_OFF_MODE)
        {
            #if (WDG_DEM_REPORT == STD_ON)
            /* If not allowed report failure */
            Appl_Dem_ReportErrorStatus ( WDG_E_DISABLE_REJECTED
                                       , DEM_EVENT_STATUS_FAILED
                                       );
            #endif
            ret = E_NOT_OK;
        }
        else
        {
    #endif /* WDG_DISABLE_ALLOWED == STD_OFF */
            /* Check window start */
            ret = wdg_tms570ls3x_check_window_start (window_start, last_timeout, config_ptr->RTICLK_khz);

            /* ret is here E_NOT_OK only if the window was violated but no
               reset occurred. This could happen if the HW is not working
               properly. */
            if (ret == E_OK)
            {
                /* Nothing to do here, only one mode is supported */
                g_wdg_tms570ls3x_current_mode     = WdgMode;
                g_wdg_tms570ls3x_current_mode_INV = (WdgIf_ModeType)~WdgMode;
            }
    #if (WDG_DISABLE_ALLOWED == STD_OFF)
        }
    #endif /* WDG_DISABLE_ALLOWED == STD_OFF */
    }

    return ret;
}

/* PRQA S 1503 1 */
FUNC(Std_ReturnType, WDG_CODE) Wdg_TMS570LS3x_SetTriggerWindow
    ( VAR (uint8, AUTOMATIC) WdgInstance
    , VAR (uint16, AUTOMATIC) WindowStart
    , VAR (uint16, AUTOMATIC) Timeout
    )
{
    VAR (Std_ReturnType, AUTOMATIC) ret = E_OK;
    VAR (uint16, AUTOMATIC) det_max_ms;
    VAR (uint32, AUTOMATIC) check_ms;
    VAR (uint32, AUTOMATIC) wd_cntr_old;
    VAR (uint32, AUTOMATIC) wd_cntr;
    VAR (uint16, AUTOMATIC) window_start;
    VAR (uint16, AUTOMATIC) last_timeout;
    VAR (WdgIf_ModeType, AUTOMATIC) current_mode;
    P2CONST (Wdg_TMS570LS3x_ConfigType, AUTOMATIC, WDG_APPL_CONST) config_ptr;

    /* Check global variables for consistency */
    window_start = g_wdg_tms570ls3x_window_start;
    last_timeout = g_wdg_tms570ls3x_last_timeout;
    current_mode = g_wdg_tms570ls3x_current_mode;
    config_ptr   = g_wdg_tms570ls3x_cfg_ptr;
    /* PRQA S 0306 4 */ /* PRQA S 3355 4 */ /* PRQA S 3358 4 */
    if ( ((uint16)~window_start != g_wdg_tms570ls3x_window_start_INV)
      || ((uint16)~last_timeout != g_wdg_tms570ls3x_last_timeout_INV)
      || ((WdgIf_ModeType)~current_mode != g_wdg_tms570ls3x_current_mode_INV)
      || ((uint32)~(uint32)config_ptr != (uint32)g_wdg_tms570ls3x_cfg_ptr_INV)
       )
    {
        /* Memory courruption detected! Perform a RESET */
        ret = E_NOT_OK;
        wdg_tms570ls3x_reset ();
    }

    /* Development error detect */
    else if (g_wdg_tms570ls3x_cfg_ptr == NULL_PTR) /* PRQA S 3201 */
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_SetTriggerWindow
                             , WDG_E_DRIVER_STATE
                             );
        #endif
        ret = E_NOT_OK;
    }
    else if (WdgInstance > 0u)
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_SetMode
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
        ret = E_NOT_OK;
    }
    else
    {
        /* Get the maximum settable milliseconds for this mode */
        if (current_mode == WDGIF_FAST_MODE)
        {
            det_max_ms = g_wdg_tms570ls3x_cfg_ptr->BasicCfgPtr->FastModeMax_ms;
        }
        else
        {
            det_max_ms = g_wdg_tms570ls3x_cfg_ptr->BasicCfgPtr->SlowModeMax_ms;
        }

        if (  (WindowStart > det_max_ms)
           || (Timeout     > det_max_ms)
           || (WindowStart > Timeout)
           )
        {
            #if (WDG_DEV_ERROR_DETECT == STD_ON)
            Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                                 , WDG_TMS570LS3x_VENDOR_ID
                                 , API_ID_Wdg_SetTriggerWindow
                                 , WDG_E_PARAM_TIMEOUT
                                 );
            #endif
            ret = E_NOT_OK;
        }
    }

    /* If DET checks were successful */
    if (ret == E_OK) /* PRQA S 3356 */ /* PRQA S 3359 */
    { /* PRQA S 3201 */
        if (Timeout == 0u)
        {
            ret = E_NOT_OK;
            wdg_tms570ls3x_reset ();
        }
        else if (Timeout != g_wdg_tms570ls3x_cfg_ptr->BasicCfgPtr->InitialTimeout_ms)
        {
            /* TMS570LS3x's watchdog can be set only once! */
            #if (WDG_DEV_ERROR_DETECT == STD_ON)
            Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                                 , WDG_TMS570LS3x_VENDOR_ID
                                 , API_ID_Wdg_SetTriggerWindow
                                 , WDG_E_PARAM_TIMEOUT
                                 );
            #endif
            ret = E_NOT_OK;
        }
        else
        {

