sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Source/BSW/Wdg/Wdg_TMS570LS3x.c
            /* Check window start */
            ret = wdg_tms570ls3x_check_window_start
                (window_start, last_timeout, config_ptr->RTICLK_khz);

            /* ret is here E_NOT_OK only if the window was violated but no
               reset occurred. This could happen if the HW is not working
               properly. */
            if (ret == E_OK)
            {
                g_wdg_tms570ls3x_window_start     = WindowStart;
                g_wdg_tms570ls3x_window_start_INV = (uint16)~WindowStart;

                /* No need to set g_wdg_tms570ls3x_last_timeout again */

                /* Disable interrupts */
                (void) Wdg_GlobalSuspendInterrupts(); /* PRQA S 3335 */
                wd_cntr_old = READ_RTIDWDCNTR; /* PRQA S 0303 */
                /* Service watchdog */
                WRITE_RTIWDKEY (RTIWDKEY_PREPARE); /* PRQA S 0303 */
                WRITE_RTIWDKEY (RTIWDKEY_TRIGGER); /* PRQA S 0303 */
                wd_cntr = READ_RTIDWDCNTR; /* PRQA S 0303 */
                /* Restore interrupts */
                (void) Wdg_GlobalRestoreInterrupts(); /* PRQA S 3335 */

                /* Check if wdg timer value is as expected */
                check_ms = WDG_TMS570LS3x_WDTICKS_TO_MS (wd_cntr, config_ptr->RTICLK_khz);

                /* If watchdog not running or not enabled - assume an error */
                if (  ( !(wd_cntr > wd_cntr_old))
                   /* If wdg timer value is not as expected - assume an error */
                   || (check_ms > Timeout)
                   || (check_ms < (Timeout - 1u))
                   )
                {
                    ret = E_NOT_OK;
                }
            }
        }
    }

    return ret;
}

#if (WDG_VERSION_INFO_API == STD_ON)
/* PRQA S 1503 1 */
FUNC(void, WDG_CODE) Wdg_TMS570LS3x_GetVersionInfo
    (P2VAR (Std_VersionInfoType, AUTOMATIC, WDG_APPL_DATA) VersionInfoPtr)
{
    if (VersionInfoPtr == NULL_PTR)
    {
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        Appl_Det_ReportError ( WDG_TMS570LS3x_MODULE_ID
                             , WDG_TMS570LS3x_VENDOR_ID
                             , API_ID_Wdg_GetVersionInfo
                             , WDG_E_PARAM_CONFIG
                             );
        #endif
    }
    else
    {
        VersionInfoPtr->vendorID         = WDG_VENDOR_ID;
        VersionInfoPtr->moduleID         = WDG_MODULE_ID;
        VersionInfoPtr->sw_major_version = WDG_TMS570LS3x_SW_MAJOR_VERSION;
        VersionInfoPtr->sw_minor_version = WDG_TMS570LS3x_SW_MINOR_VERSION;
        VersionInfoPtr->sw_patch_version = WDG_TMS570LS3x_SW_PATCH_VERSION;
    }
}
#endif /* WDG_VERSION_INFO_API == STD_ON */

#if (WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON)
/* PRQA S 1503 1 */
FUNC(uint32, WDG_CODE) Wdg_TMS570LS3x_GetTickCounter (void)
{
    return READ_RTIFRC1; /* PRQA S 0303 */
}
#endif /* WDG_TMS570LS3x_INTERNAL_TICK_COUNTER == STD_ON */

#if defined(WDG_UNIT_TESTS)
  #if (WDG_UNIT_TESTS == 1)
    #if (defined(__CANTATA__))
    #if (__CANTATA__ == 1)
    /* Do not instrument in Cantata++ - these functions are part of the test
       cases and not of the module's functionality. */
    #pragma ipl cantata++ ci instr all off
    #endif
    #endif

    /* grant access to internal static resources for the unit tests */
    const Wdg_TMS570LS3x_ConfigType* tc_wdg_get_cfg_ptr(void)
    {
        return g_wdg_tms570ls3x_cfg_ptr;
    }
    void tc_wdg_deinit_wdg (void)
    {
        g_wdg_tms570ls3x_window_start     = 0;
        g_wdg_tms570ls3x_window_start_INV = (uint16)~0;
        g_wdg_tms570ls3x_last_timeout     = 0;
        g_wdg_tms570ls3x_last_timeout_INV = (uint16)~0;
        g_wdg_tms570ls3x_cfg_ptr          = NULL_PTR;
        g_wdg_tms570ls3x_cfg_ptr_INV      =
            (const Wdg_TMS570LS3x_ConfigType *)(~(uint32)NULL_PTR);
        g_wdg_tms570ls3x_current_mode     = WDGIF_OFF_MODE;
        g_wdg_tms570ls3x_current_mode_INV = (WdgIf_ModeType)~WDGIF_OFF_MODE;
    }
    WdgIf_ModeType tc_get_g_wdg_tms570ls3x_current_mode (void)
    {
        return g_wdg_tms570ls3x_current_mode;
    }
    uint16 tc_get_g_wdg_tms570ls3x_window_start (void)
    {
        return g_wdg_tms570ls3x_window_start;
    }
    uint16 tc_get_g_wdg_tms570ls3x_last_timeout (void)
    {
        return g_wdg_tms570ls3x_last_timeout;
    }

    uint32 tc_wdg_tms570ls3x_convert_ms_to_wdticks (uint16 ms)
    {
        return WDG_TMS570LS3x_MS_TO_WDTICKS (ms, g_wdg_tms570ls3x_cfg_ptr->RTICLK_khz);
    }

    /* access functions to manipulate the module internal variables */
    void tc_write_g_wdg_tms570ls3x_cfg_ptr (const Wdg_TMS570LS3x_ConfigType* x)
    {
        g_wdg_tms570ls3x_cfg_ptr = x;
    }
    void tc_write_g_wdg_tms570ls3x_cfg_ptr_INV (const Wdg_TMS570LS3x_ConfigType* x)
    {
        g_wdg_tms570ls3x_cfg_ptr_INV = x;
    }
    void tc_write_g_wdg_tms570ls3x_last_timeout (uint16 x)
    {
        g_wdg_tms570ls3x_last_timeout = x;
    }
    void tc_write_g_wdg_tms570ls3x_last_timeout_INV (uint16 x)
    {
        g_wdg_tms570ls3x_last_timeout_INV = x;
    }
    void tc_write_g_wdg_tms570ls3x_window_start (uint16 x)
    {
        g_wdg_tms570ls3x_window_start = x;
    }
    void tc_write_g_wdg_tms570ls3x_window_start_INV (uint16 x)
    {
        g_wdg_tms570ls3x_window_start_INV = x;
    }
    void tc_write_g_wdg_tms570ls3x_current_mode (uint16 x)
    {
        g_wdg_tms570ls3x_current_mode = x;
    }
    void tc_write_g_wdg_tms570ls3x_current_mode_INV (uint16 x)
    {
        g_wdg_tms570ls3x_current_mode_INV = x;
    }
    #if (defined(__CANTATA__))
    #if (__CANTATA__ == 1)
    #pragma ipl cantata++ ci instr all default
    #endif
    #endif
  #endif
#endif



#define WDG_STOP_SEC_CODE
#include "MemMap.h" /* PRQA S 5087 */
